cfg/Documents/УдалитьРегистрацияСобеседованияКандидата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>УдалитьРегистрацияСобеседованияКандидата</Name>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобеседования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяСобеседования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИнтервалыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСобеседования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСостоянияКандидатаНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеСобеседования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФакт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/Enums/ИнтервалыВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ИнтервалыВремени</Name>
			<Comment>Обслуживает планирование собеседований</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Интервал1</Name>
					<Comment>00:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал2</Name>
					<Comment>00:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал3</Name>
					<Comment>01:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал4</Name>
					<Comment>01:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал5</Name>
					<Comment>02:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал6</Name>
					<Comment>02:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал7</Name>
					<Comment>03:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал8</Name>
					<Comment>03:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал9</Name>
					<Comment>04:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал10</Name>
					<Comment>04:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал11</Name>
					<Comment>05:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал12</Name>
					<Comment>05:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал13</Name>
					<Comment>06:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал14</Name>
					<Comment>06:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал15</Name>
					<Comment>07:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал16</Name>
					<Comment>07:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал17</Name>
					<Comment>08:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал18</Name>
					<Comment>08:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал19</Name>
					<Comment>09:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал20</Name>
					<Comment>09:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал21</Name>
					<Comment>10:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал22</Name>
					<Comment>10:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал23</Name>
					<Comment>11:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал24</Name>
					<Comment>11:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал25</Name>
					<Comment>12:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал26</Name>
					<Comment>12:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал27</Name>
					<Comment>13:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал28</Name>
					<Comment>13:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал29</Name>
					<Comment>14:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал30</Name>
					<Comment>14:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал31</Name>
					<Comment>15:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал32</Name>
					<Comment>15:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал33</Name>
					<Comment>16:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал34</Name>
					<Comment>16:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал35</Name>
					<Comment>17:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал36</Name>
					<Comment>17:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал37</Name>
					<Comment>18:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал38</Name>
					<Comment>18:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал39</Name>
					<Comment>19:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал40</Name>
					<Comment>19:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал41</Name>
					<Comment>20:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал42</Name>
					<Comment>20:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал43</Name>
					<Comment>21:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал44</Name>
					<Comment>21:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал45</Name>
					<Comment>22:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал46</Name>
					<Comment>22:30</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал47</Name>
					<Comment>23:00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервал48</Name>
					<Comment>23:30</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Documents/УдалитьРегистрацияСобеседованияКандидата/Forms/ФормаДокументаРасписание/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит текущую дату документа - для проверки перехода документа в другой период установки номера
Перем мТекущаяДатаДокумента;
Перем мДлинаСуток;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ
 
// Процедура построения графика собеседований.
//
// Параметры: 
//  Нет.	            
//
//
Процедура ПостроитьГрафикСобеседований()
	
	НазначенноеВремя = ВремяСобеседования;
	
	ПолеСобеседований.Очистить(); 	
     
	КоличествоИнтервалов = Перечисления.ИнтервалыВремени.Количество();
	
	Для индекс = 0 по КоличествоИнтервалов-1  цикл
		ПолеСобеседований.Добавить().Время = Перечисления.ИнтервалыВремени.Получить(индекс);
	КонецЦикла;
	
	Запрос = новый Запрос(
		"ВЫБРАТЬ
		|	ВЫБОР КОГДА (НазначенныеСобеседования.ИнтервалВремени) ЕСТЬ NULL  ТОГДА &ВремяПоУмолчанию ИНАЧЕ НазначенныеСобеседования.ИнтервалВремени КОНЕЦ КАК ИнтервалВремени,
		|	НазначенныеСобеседования.ФизЛицо.Наименование КАК ФизЛицо
		|ИЗ
		|	РегистрСведений.НазначенныеСобеседования КАК НазначенныеСобеседования
		|
		|ГДЕ
		|	НазначенныеСобеседования.Дата = &ДатаСобеседования");
	
	Запрос.УстановитьПараметр("ДатаСобеседования",ДатаСобеседования);
	Запрос.УстановитьПараметр("ВремяПоУмолчанию",Перечисления.ИнтервалыВремени.Интервал1);
	
	ТабличноеПоле1 = запрос.Выполнить().Выгрузить();
		
	Для каждого СтрокаЗапроса Из ТабличноеПоле1 Цикл
		
		Структура = новый Структура;
		Структура.Вставить("Время",СтрокаЗапроса.ИнтервалВремени);
		СтрокаВТаблице = ПолеСобеседований.НайтиСтроки(структура); 
		Если СтрокаВТаблице.Количество()=0 тогда 
			стр = ПолеСобеседований[0]
		Иначе
			стр = СтрокаВТаблице[0];
		КонецЕсли;
		
		стр.Количество = стр.Количество + 1;
		
		Если НЕ ЗначениеЗаполнено(Стр.ФизЛица) Тогда 
			стр.ФизЛица = СтрокаЗапроса.ФизЛицо 
		Иначе
			стр.ФизЛица = Стр.ФизЛица + "; " + СтрокаЗапроса.ФизЛицо; 
		КонецЕсли;
						
	КонецЦикла;
	
    // Установить значение времени
	
	Для каждого	СтрокаВТаблице из ПолеСобеседований Цикл	
		Если  СтрокаВТаблице.Время = НазначенноеВремя тогда
			ЭлементыФормы.ПолеСобеседований.ТекущаяСтрока = СтрокаВТаблице;
		КонецЕсли;
	КонецЦикла;

 КонецПроцедуры // ПостроитьГрафиксобеседований()
  
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМ

// Обработчик события "При открытии" формы 
Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда // проверить объект на то, что он еще не внесен в ИБ
		
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		ОбщегоНазначения.УстановитьНомерДокумента(ЭтотОбъект);
		ДатаСобеседования = РабочаяДата;	
		
		// Преобразовать текущее время в интервал.
		Индекс = 0;
		Индекс = Число(Сред(ТекущаяДата(),12,2)) * 2;
  		Минут = Число(Сред(ТекущаяДата(),15,2));
		
		Если Минут > 15 Тогда 
			Индекс = Индекс + 1;
		КонецЕсли;
		
		Если Минут > 40 Тогда
			Индекс = Индекс + 1;
		КонецЕсли;

		Если Индекс > 47 тогда 
			Индекс = 0;
			ДатаСобеседования = ДатаСобеседования + мДлинаСуток;
		КонецЕсли;
		
		ВремяСобеседования = Перечисления.ИнтервалыВремени[Индекс];

	КонецЕсли;

	// Вывести в заголовке формы статус документа (новый, не проведен, проведен).
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, ЭтотОбъект, ЭтаФорма);
	
	// Запомнить текущие значения реквизитов формы.
	мТекущаяДатаДокумента = Дата;
	
	// Построить график собеседований
	ПостроитьГрафикСобеседований();
		
КонецПроцедуры

// Обработчик события "ПослеЗаписи" формы 
Процедура ПослеЗаписи()
	
	// Вывести в заголовке формы статус документа (новый, не проведен, проведен).
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, ЭтотОбъект, ЭтаФорма);
	
КонецПроцедуры

// Обработчик события "ПриЗакрытии" формы 
Процедура ПриЗакрытии()
	
Оповестить("ОбновитьФорму",ФизЛицо );
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура вызывается при выборе пункта подменю "Движения документа по регистрам" меню "Перейти".
// командной панели формы. Процедура отрабатывает печать движений документа по регистрам.
//
Процедура ДействияФормыДвиженияДокументаПоРегистрам(Кнопка)

	РаботаСДиалогами.НапечататьДвиженияДокумента(Ссылка);

КонецПроцедуры // ДействияФормыДвиженияДокументаПоРегистрам()

// Обработчик события Нажатие элемента формы "НазначитьВстречу".
// Открывает форму нового события.
//
Процедура ОсновныеДействияФормыНазначитьВстречу(Кнопка)
	
	Отказ = Ложь;

	Если Модифицированность() Тогда
		Если Вопрос(НСтр("ru='Для назначения события необходимо записать документ. Записать?';uk='Для призначення події необхідно записати документ. Записати?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да,) = КодВозвратаДиалога.Да Тогда
			Отказ = Не ЗаписатьВФорме();
		Иначе
			Возврат
		КонецЕсли;
	КонецЕсли;

	Если Отказ Тогда
		Возврат
	КонецЕсли;

	// откроем форму нового события
	ПолучитьДокументСобытие(Перечисления.ВидыСобытий.ЛичнаяВстреча).ПолучитьФорму("ФормаДокумента").Открыть();
	
КонецПроцедуры

// Обработчик события Нажатие элемента формы "НазначитьЗвонок".
// Открывает форму нового события.
//
Процедура ОсновныеДействияФормыНазначитьЗвонок(Кнопка)
	
	Отказ = Ложь;

	Если Модифицированность() Тогда
		Если Вопрос(НСтр("ru='Для назначения события необходимо записать документ. Записать?';uk='Для призначення події необхідно записати документ. Записати?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да,) = КодВозвратаДиалога.Да Тогда
			Отказ = Не ЗаписатьВФорме();
		Иначе
			Возврат
		КонецЕсли;
	КонецЕсли;

	Если Отказ Тогда
		Возврат
	КонецЕсли;

	// откроем форму нового события
	ПолучитьДокументСобытие(Перечисления.ВидыСобытий.ТелефонныйЗвонок).ПолучитьФорму("ФормаДокумента").Открыть();
	
КонецПроцедуры  // ОсновныеДействияФормыНазначитьЗвонок

// Обработчик события Нажатие элемента формы "НазначитьПисьмо".
// Открывает форму нового события.
//
Процедура ОсновныеДействияФормыНазначитьПисьмо(Кнопка)
	
	Отказ = Ложь;

	Если Модифицированность() Тогда
		Если Вопрос(НСтр("ru='Для назначения события необходимо записать документ. Записать?';uk='Для призначення події необхідно записати документ. Записати?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да,) = КодВозвратаДиалога.Да Тогда
			Отказ = Не ЗаписатьВФорме();
		Иначе
			Возврат
		КонецЕсли;
	КонецЕсли;

	Если Отказ Тогда
		Возврат
	КонецЕсли;

	// откроем форму нового события
	ПолучитьДокументСобытие(Перечисления.ВидыСобытий.ЭлектронноеПисьмо).ПолучитьФорму("ФормаДокумента").Открыть();
	
КонецПроцедуры  // ОсновныеДействияФормыНазначитьПисьмо

///////////////////////////////////////////////////////////////////////////////
// Панель графика собеседований

// Обработчик события Нажатие элемента формы "ДеньНазад".
// Уменьшает значение переменной "ДатаСобеседования" на один день
// и вызывает функцию "ПостроитьГрафиксобеседований()".
//
Процедура ДеньНазадНажатие(Элемент)
	
	 ДатаСобеседования = ДатаСобеседования - мДлинаСуток;
	 ПостроитьГрафиксобеседований()
	 	
КонецПроцедуры // ДеньНазадНажатие(Элемент)

// Обработчик события Нажатие элемента формы "ДеньВперед".
// Увеличивает значение переменной "ДатаСобеседования" на один день
// и вызывает функцию "ПостроитьГрафиксобеседований()".
//
Процедура ДеньВпередНажатие(Элемент)
	
	 ДатаСобеседования = ДатаСобеседования + мДлинаСуток;
	 ПостроитьГрафиксобеседований()
	
КонецПроцедуры // ДеньВпередНажатие(Элемент)

// Обработчик события Нажатие элемента формы "Сегодня".
// Устанавливает значение переменной "ДатаСобеседования" на текущую дату
// и вызывает функцию "ПостроитьГрафиксобеседований()".
//
Процедура СегодняНажатие(Элемент)
	
	 ДатаСобеседования = ТекущаяДата();
	 ПостроитьГрафиксобеседований()

КонецПроцедуры // СегодняНажатие(Элемент)

// Обработчик события Нажатие элемента формы "Завтра".
// Устанавливает значение переменной "ДатаСобеседования" на текущую дату 
// плюс один день и вызывает функцию "ПостроитьГрафиксобеседований()".
//
Процедура ЗавтраНажатие(Элемент)
	
	 ДатаСобеседования = ТекущаяДата() + мДлинаСуток;
	 ПостроитьГрафиксобеседований()
	
КонецПроцедуры // ЗавтраНажатие(Элемент)

// Обработчик события Нажатие элемента формы "МесяцНазад".
// Устанавливает значение переменной "ДатаСобеседования" на один месяц вперед
// и вызывает функцию "ПостроитьГрафиксобеседований()".
//
Процедура КоманднаяПанельМесяцНазад(Кнопка)
	
	 ДатаСобеседования = ДатаСобеседования - мДлинаСуток*30;
	 ПостроитьГрафиксобеседований()

	
КонецПроцедуры // КоманднаяПанельМесяцНазад(Кнопка)

// Обработчик события Нажатие элемента формы "МесяцНазад".
// Устанавливает значение переменной "ДатаСобеседования" на один месяц назад
// и вызывает функцию "ПостроитьГрафиксобеседований()".
//
Процедура КоманднаяПанельМесяцВперед(Кнопка)
	
	 ДатаСобеседования = ДатаСобеседования + мДлинаСуток*30;
	 ПостроитьГрафиксобеседований()
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ 

// Процедура - обработчик события "ПриИзменении" поля ввода даты документа.
//
Процедура ДатаПриИзменении(Элемент)

	РаботаСДиалогами.ПроверитьНомерДокумента(ЭтотОбъект, мТекущаяДатаДокумента);
	мТекущаяДатаДокумента = Дата;

КонецПроцедуры // ДатаПриИзменении

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события "ПриАктивизацииСтроки" интерфейсного объекта "ПолеСобеседований".
// Устанавливает переменную "ВремяСобеседования". 
// 
//
Процедура ПолеСобеседованийПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущаяСтрока = неопределено Тогда 
		Возврат 
	КонецЕсли;
	ВремяСобеседования = Элемент.ТекущаяСтрока.Время;

КонецПроцедуры // ПолеСобеседованийПриАктивизацииЯчейки(Элемент)

// Обработчик события "ПриИзменении" интерфейсного объекта "ДатаСобеседования".
// Вызывает процедуру "ПостроитьГрафиксобеседований()". 
// 
//
Процедура ДатаСобеседованияПриИзменении(Элемент)
	
	 ПостроитьГрафиксобеседований()
	 
 КонецПроцедуры // ДатаСобеседованияПриИзменении(Элемент)

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ

// Процедура выполняет открытие формы работы со свойствами документа
//
Процедура ДействияФормыДействиеОткрытьСвойства(Кнопка)

	РаботаСДиалогами.ОткрытьСвойстваДокумента(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры

// Процедура выполняет открытие формы работы с категориями документа
//
Процедура ДействияФормыДействиеОткрытьКатегории(Кнопка)

	РаботаСДиалогами.ОткрытьКатегорииДокумента(ЭтотОбъект, ЭтаФорма);

КонецПроцедуры
               
// Процедура вызова структуры подчиненности документа
Процедура ДействияФормыСтруктураПодчиненностиДокумента(Кнопка)
	РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Ссылка);
КонецПроцедуры





мДлинаСуток = 86400;
